# CreateCustThumbPopup

## Description
Creates a custom thumbnail popup that can be populated with previews of objects in Vectorworks.

```pascal
PROCEDURE CreateCustThumbPopup(
				dialogID  : LONGINT;
				controlID : LONGINT;
				sizeType  : INTEGER);
```

```python

def vs.CreateCustThumbPopup(dialogID, controlID, sizeType):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|The dialog identifier given by the command to create the dialog.|
|controlID|LONGINT|The identifier that should be assigned to the control.|
|sizeType|INTEGER|The size type of the control|

## Version
Availability: from Vectorworks 2013
## Category
* Dialogs - Modern